flange-build/flange/components/packages/cardputer-all-in-one/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# Task 2 起 TinyUSB 接管 native USB(GPIO19/20)，USB-Serial-JTAG 控制台失效，日志改走 UART0
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_FREERTOS_HZ=1000
# TinyUSB vendor 类：esp_tinyusb 用 *_COUNT(int) 启用，>0 即开启 CFG_TUD_VENDOR
# （注：vendor RX/TX bufsize 在 esp_tinyusb tusb_config.h 中硬编码，无 Kconfig 选项）
CONFIG_TINYUSB_VENDOR_COUNT=1
# TinyUSB HID 键盘接口：>0 即开启 CFG_TUD_HID
CONFIG_TINYUSB_HID_COUNT=1
